nxp-mcuxpresso/mcux-sdk/devices/LPC5504CPXXXX/LPC5504CPXXXX.h
#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER0_FIELD_MASK (0xFFFFFFFFU)
#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER0_FIELD_SHIFT (0U)
/*! FIELD - .
 */
#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER0_FIELD(x) (((uint32_t)(((uint32_t)(x)) << FLASH_KEY_STORE_PRINCE_REGION2_HEADER0_FIELD_SHIFT)) & FLASH_KEY_STORE_PRINCE_REGION2_HEADER0_FIELD_MASK)
/*! @} */

/*! @name PRINCE_REGION2_HEADER1 - . */
/*! @{ */

#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_TYPE_MASK (0x3U)
#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_TYPE_SHIFT (0U)
/*! TYPE - .
 */
#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_TYPE(x) (((uint32_t)(((uint32_t)(x)) << FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_TYPE_SHIFT)) & FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_TYPE_MASK)

#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_INDEX_MASK (0xF00U)
#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_INDEX_SHIFT (8U)
/*! INDEX - .
 */
#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_INDEX(x) (((uint32_t)(((uint32_t)(x)) << FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_INDEX_SHIFT)) & FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_INDEX_MASK)

#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_SIZE_MASK (0x3F000000U)
#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_SIZE_SHIFT (24U)
/*! SIZE - .
 */
#define FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_SIZE(x) (((uint32_t)(((uint32_t)(x)) << FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_SIZE_SHIFT)) & FLASH_KEY_STORE_PRINCE_REGION2_HEADER1_SIZE_MASK)
/*! @} */

/*! @name PRINCE_REGION2_BODY - . */
/*! @{ */

#define FLASH_KEY_STORE_PRINCE_REGION2_BODY_FIELD_MASK (0xFFFFFFFFU)
#define FLASH_KEY_STORE_PRINCE_REGION2_BODY_FIELD_SHIFT (0U)
/*! FIELD - .
 */
#define FLASH_KEY_STORE_PRINCE_REGION2_BODY_FIELD(x) (((uint32_t)(((uint32_t)(x)) << FLASH_KEY_STORE_PRINCE_REGION2_BODY_FIELD_SHIFT)) & FLASH_KEY_STORE_PRINCE_REGION2_BODY_FIELD_MASK)
/*! @} */

/* The count of FLASH_KEY_STORE_PRINCE_REGION2_BODY */
#define FLASH_KEY_STORE_PRINCE_REGION2_BODY_COUNT (12U)


/*!
 * @}
 */ /* end of group FLASH_KEY_STORE_Register_Masks */


/* FLASH_KEY_STORE - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FLASH_KEY_STORE base address */
  #define FLASH_KEY_STORE_BASE                     (0x1003E600u)
  /** Peripheral FLASH_KEY_STORE base address */
  #define FLASH_KEY_STORE_BASE_NS                  (0x3E600u)
  /** Peripheral FLASH_KEY_STORE base pointer */
  #define FLASH_KEY_STORE                          ((FLASH_KEY_STORE_Type *)FLASH_KEY_STORE_BASE)
  /** Peripheral FLASH_KEY_STORE base pointer */
  #define FLASH_KEY_STORE_NS                       ((FLASH_KEY_STORE_Type *)FLASH_KEY_STORE_BASE_NS)
  /** Array initializer of FLASH_KEY_STORE peripheral base addresses */
  #define FLASH_KEY_STORE_BASE_ADDRS               { FLASH_KEY_STORE_BASE }
  /** Array initializer of FLASH_KEY_STORE peripheral base pointers */
  #define FLASH_KEY_STORE_BASE_PTRS                { FLASH_KEY_STORE }
  /** Array initializer of FLASH_KEY_STORE peripheral base addresses */
  #define FLASH_KEY_STORE_BASE_ADDRS_NS            { FLASH_KEY_STORE_BASE_NS }
  /** Array initializer of FLASH_KEY_STORE peripheral base pointers */
  #define FLASH_KEY_STORE_BASE_PTRS_NS             { FLASH_KEY_STORE_NS }
#else
  /** Peripheral FLASH_KEY_STORE base address */
  #define FLASH_KEY_STORE_BASE                     (0x3E600u)
  /** Peripheral FLASH_KEY_STORE base pointer */
  #define FLASH_KEY_STORE                          ((FLASH_KEY_STORE_Type *)FLASH_KEY_STORE_BASE)
  /** Array initializer of FLASH_KEY_STORE peripheral base addresses */
  #define FLASH_KEY_STORE_BASE_ADDRS               { FLASH_KEY_STORE_BASE }
  /** Array initializer of FLASH_KEY_STORE peripheral base pointers */
  #define FLASH_KEY_STORE_BASE_PTRS                { FLASH_KEY_STORE }
#endif

/*!
 * @}
 */ /* end of group FLASH_KEY_STORE_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- FLASH_NMPA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLASH_NMPA_Peripheral_Access_Layer FLASH_NMPA Peripheral Access Layer
 * @{
 */

/** FLASH_NMPA - Register Layout Typedef */
typedef struct {
  union {                                          /* offset: 0x0 */
    struct {                                         /* offset: 0x0 */
      __IO uint32_t GPO0_0;                            /**< GPO0 register 0 description, offset: 0x0 */
      __IO uint32_t GPO0_1;                            /**< GPO0 register 1 description, offset: 0x4 */
      __IO uint32_t GPO0_2;                            /**< GPO0 register 2 description, offset: 0x8 */
      __IO uint32_t GPO0_3;                            /**< GPO0 register 3 description, offset: 0xC */
    } GPO0;
    __IO uint32_t GPO0_ARRAY[4];                     /**< GPO0 array description, array offset: 0x0, array step: 0x4 */
  };
  union {                                          /* offset: 0x10 */
    struct {                                         /* offset: 0x10 */
      __IO uint32_t GPO1_0;                            /**< GPO1 register 0 description, offset: 0x10 */
      __IO uint32_t GPO1_1;                            /**< GPO1 register 1 description, offset: 0x14 */
      __IO uint32_t GPO1_2;                            /**< GPO1 register 2 description, offset: 0x18 */
      __IO uint32_t GPO1_3;                            /**< GPO1 register 3 description, offset: 0x1C */
    } GPO1;
    __IO uint32_t GPO1_ARRAY[4];                     /**< GPO1 array description, array offset: 0x10, array step: 0x4 */
  };
  union {                                          /* offset: 0x20 */
    struct {                                         /* offset: 0x20 */
      __IO uint32_t GPO2_0;                            /**< GPO2 register 0 description, offset: 0x20 */
      __IO uint32_t GPO2_1;                            /**< GPO2 register 1 description, offset: 0x24 */
      __IO uint32_t GPO2_2;                            /**< GPO2 register 2 description, offset: 0x28 */
      __IO uint32_t GPO2_3;                            /**< GPO2 register 3 description, offset: 0x2C */
    } GPO2;
    __IO uint32_t GPO2_ARRAY[4];                     /**< GPO2 array description, array offset: 0x20, array step: 0x4 */
  };
  union {                                          /* offset: 0x30 */
    struct {                                         /* offset: 0x30 */
      __IO uint32_t GPO3_0;                            /**< GPO3 register 0 description, offset: 0x30 */
      __IO uint32_t GPO3_1;                            /**< GPO3 register 1 description, offset: 0x34 */
      __IO uint32_t GPO3_2;                            /**< GPO3 register 2 description, offset: 0x38 */
      __IO uint32_t GPO3_3;                            /**< GPO3 register 3 description, offset: 0x3C */
    } GPO3;
    __IO uint32_t GPO3_ARRAY[4];                     /**< GPO3 array description, array offset: 0x30, array step: 0x4 */
  };
  union {                                          /* offset: 0x40 */
    struct {                                         /* offset: 0x40 */
      __IO uint32_t GPO_CHECKSUM_0;                    /**< checksum of the GPO data in words 0, offset: 0x40 */
      __IO uint32_t GPO_CHECKSUM_1;                    /**< checksum of the GPO data in words 1, offset: 0x44 */
      __IO uint32_t GPO_CHECKSUM_2;                    /**< checksum of the GPO data in words 2, offset: 0x48 */
      __IO uint32_t GPO_CHECKSUM_3;                    /**< checksum of the GPO data in words 3, offset: 0x4C */
    } GPO_CHECKSUM;
    __IO uint32_t GPO_CHECKSUM_ARRAY[4];             /**< checksum of the GPO data in words [3:0], array offset: 0x40, array step: 0x4 */
  };
  union {                                          /* offset: 0x50 */
    struct {                                         /* offset: 0x50 */
      __IO uint32_t FINAL_TEST_BATCH_ID_0;             /**< , offset: 0x50 */
      __IO uint32_t FINAL_TEST_BATCH_ID_1;             /**< , offset: 0x54 */
      __IO uint32_t FINAL_TEST_BATCH_ID_2;             /**< , offset: 0x58 */
      __IO uint32_t FINAL_TEST_BATCH_ID_3;             /**< , offset: 0x5C */
    } FINAL_TEST_BATCH_ID;
    __IO uint32_t FINAL_TEST_BATCH_ID_ARRAY[4];      /**< , array offset: 0x50, array step: 0x4 */
  };
  __IO uint32_t DEVICE_TYPE;                       /**< , offset: 0x60 */
  __IO uint32_t FINAL_TEST_PROGRAM_VERSION;        /**< , offset: 0x64 */
  __IO uint32_t FINAL_TEST_DATE;                   /**< , offset: 0x68 */
  __IO uint32_t FINAL_TEST_TIME;                   /**< , offset: 0x6C */
  union {                                          /* offset: 0x70 */
    struct {                                         /* offset: 0x70 */
      __IO uint32_t UUID_0;                            /**< , offset: 0x70 */
      __IO uint32_t UUID_1;                            /**< , offset: 0x74 */
      __IO uint32_t UUID_2;                            /**< , offset: 0x78 */
      __IO uint32_t UUID_3;                            /**< , offset: 0x7C */
    } UUID;
    __IO uint32_t UUID_ARRAY[4];                     /**< , array offset: 0x70, array step: 0x4 */
  };
  __IO uint32_t WAFER_TEST1_PROGRAM_VERSION;       /**< , offset: 0x80 */
  __IO uint32_t WAFER_TEST1_DATE;                  /**< , offset: 0x84 */
  __IO uint32_t WAFER_TEST1_TIME;                  /**< , offset: 0x88 */
       uint8_t RESERVED_0[4];
  __IO uint32_t WAFER_TEST2_PROGRAM_VERSION;       /**< , offset: 0x90 */
  __IO uint32_t WAFER_TEST2_DATE;                  /**< , offset: 0x94 */
  __IO uint32_t WAFER_TEST2_TIME;                  /**< , offset: 0x98 */
  __IO uint32_t USBCFG;                            /**< , offset: 0x9C */
  __IO uint32_t PERIPHENCFG;                       /**< , offset: 0xA0 */
  __IO uint32_t RAMSIZECFG;                        /**< , offset: 0xA4 */
  __IO uint32_t FLASHSIZECFG;                      /**< , offset: 0xA8 */
       uint8_t RESERVED_1[4];
  __IO uint32_t RINGO_0;                           /**< , offset: 0xB0 */
  __IO uint32_t RINGO_1;                           /**< , offset: 0xB4 */
  __IO uint32_t RINGO_2;                           /**< , offset: 0xB8 */
       uint8_t RESERVED_2[4];
  __IO uint32_t FRO_192MHZ;                        /**< , offset: 0xC0 */
       uint8_t RESERVED_3[4];
  __IO uint32_t XO_32MHZ;                          /**< , offset: 0xC8 */
  __IO uint32_t XO_32KHZ;                          /**< , offset: 0xCC */
  __IO uint32_t FRO_1MHZ;                          /**< , offset: 0xD0 */
       uint8_t RESERVED_4[4];
  union {                                          /* offset: 0xD8 */
    struct {                                         /* offset: 0xD8 */
      __IO uint32_t DCDC_POWER_PROFILE_HIGH_0;         /**< , offset: 0xD8 */
      __IO uint32_t DCDC_POWER_PROFILE_HIGH_1;         /**< , offset: 0xDC */
    } DCDC_POWER_PROFILE_HIGH;
    __IO uint32_t DCDC_POWER_PROFILE_HIGH_ARRAY[2];   /**< , array offset: 0xD8, array step: 0x4 */
  };
  union {                                          /* offset: 0xE0 */
    struct {                                         /* offset: 0xE0 */
      __IO uint32_t DCDC_POWER_PROFILE_LOW_0;          /**< , offset: 0xE0 */
      __IO uint32_t DCDC_POWER_PROFILE_LOW_1;          /**< , offset: 0xE4 */
    } DCDC_POWER_PROFILE_LOW;
    __IO uint32_t DCDC_POWER_PROFILE_LOW_ARRAY[2];   /**< , array offset: 0xE0, array step: 0x4 */
  };
  union {                                          /* offset: 0xE8 */
    struct {                                         /* offset: 0xE8 */
      __IO uint32_t DCDC_POWER_PROFILE_MEDIUM_0;       /**< , offset: 0xE8 */
      __IO uint32_t DCDC_POWER_PROFILE_MEDIUM_1;       /**< , offset: 0xEC */
    } DCDC_POWER_PROFILE_MEDIUM;
    __IO uint32_t DCDC_POWER_PROFILE_MEDIUM_ARRAY[2];   /**< , array offset: 0xE8, array step: 0x4 */
  };
  __IO uint32_t BOD;                               /**< , offset: 0xF0 */
  __IO uint32_t LDO_AO;                            /**< , offset: 0xF4 */
  __IO uint32_t SDIO_DELAY;                        /**< , offset: 0xF8 */
       uint8_t RESERVED_5[4];
  union {                                          /* offset: 0x100 */
    struct {                                         /* offset: 0x100 */
      __IO uint32_t AUX_BIAS_CURVE_AMBIENT_0;          /**< , offset: 0x100 */
      __IO uint32_t AUX_BIAS_CURVE_AMBIENT_1;          /**< , offset: 0x104 */
      __IO uint32_t AUX_BIAS_CURVE_AMBIENT_2;          /**< , offset: 0x108 */
      __IO uint32_t AUX_BIAS_CURVE_AMBIENT_3;          /**< , offset: 0x10C */
    } AUX_BIAS_CURVE_AMBIENT;
    __IO uint32_t AUX_BIAS_CURVE_AMBIENT_ARRAY[4];   /**< Aux Bias Curve Ambient (30degC), array offset: 0x100, array step: 0x4 */
  };
  union {                                          /* offset: 0x110 */
    struct {                                         /* offset: 0x110 */
      __IO uint32_t AUX_BIAS_CURVE_TEMP_0;             /**< , offset: 0x110 */
      __IO uint32_t AUX_BIAS_CURVE_TEMP_1;             /**< , offset: 0x114 */
      __IO uint32_t AUX_BIAS_CURVE_TEMP_2;             /**< , offset: 0x118 */
      __IO uint32_t AUX_BIAS_CURVE_TEMP_3;             /**< , offset: 0x11C */
    } AUX_BIAS_CURVE_TEMP;
    __IO uint32_t AUX_BIAS_CURVE_TEMP_ARRAY[4];      /**< Aux Bias Curve TEMP (105degC), array offset: 0x110, array step: 0x4 */
  };
  __IO uint32_t TEMP_SENS_VBE1VBE8_REF_1;          /**< , offset: 0x120 */
  __IO uint32_t TEMP_SENS_VBE1VBE8_REF_2;          /**< , offset: 0x124 */
  __IO uint32_t TEMP_SENS_SLOPE;                   /**< , offset: 0x128 */
  __IO uint32_t TEMP_SENS_OFFSET;                  /**< , offset: 0x12C */
  union {                                          /* offset: 0x130 */
    struct {                                         /* offset: 0x130 */
      __IO uint32_t PVT_MONITOR_0_RINGO;               /**< , offset: 0x130 */
      __IO uint32_t PVT_MONITOR_0_DELAYS_LSB;          /**< , offset: 0x134 */
      __IO uint32_t PVT_MONITOR_0_DELAYS_MSB;          /**< , offset: 0x138 */
    } PVT_MONITOR_0;
    __IO uint32_t PVT_MONITOR_0_ARRAY[3];            /**< , array offset: 0x130, array step: 0x4 */
  };
       uint8_t RESERVED_6[4];
  union {                                          /* offset: 0x140 */
    struct {                                         /* offset: 0x140 */
      __IO uint32_t PVT_MONITOR_1_RINGO;               /**< , offset: 0x140 */
      __IO uint32_t PVT_MONITOR_1_DELAYS_LSB;          /**< , offset: 0x144 */
      __IO uint32_t PVT_MONITOR_1_DELAYS_MSB;          /**< , offset: 0x148 */
    } PVT_MONITOR_1;
    __IO uint32_t PVT_MONITOR_1_ARRAY[3];            /**< , array offset: 0x140, array step: 0x4 */
  };
  __IO uint32_t NXP_DEVICE_PRIVATE_KEY[13];        /**< , array offset: 0x14C, array step: 0x4 */
  __IO uint32_t NXP_DEVICE_CERTIFICATE_0[4];       /**< NXP Device Certificate (ECDSA_sign - r[255:128]), array offset: 0x180, array step: 0x4 */
  __IO uint32_t NXP_DEVICE_CERTIFICATE_1[4];       /**< NXP Device Certificate (ECDSA_sign - r[127:0]), array offset: 0x190, array step: 0x4 */
  __IO uint32_t NXP_DEVICE_CERTIFICATE_2[4];       /**< NXP Device Certificate (ECDSA_sign - s[255:128]), array offset: 0x1A0, array step: 0x4 */
  __IO uint32_t NXP_DEVICE_CERTIFICATE_3[4];       /**< NXP Device Certificate (ECDSA_sign - s[127:0]), array offset: 0x1B0, array step: 0x4 */
  __IO uint32_t SHA256_DIGEST[8];                  /**< SHA-256 DIGEST (9EC00 - 9FDBC) ROM Patch Area + NXP Area (IMPORTANT NOTE: Pages used for Repair (N-8 to N-3) are excluded from the computation) SHA256_DIGEST0 for DIGEST[31:0]..SHA-256 DIGEST (9EC00 - 9FDBC) ROM Patch Area + NXP Area (IMPORTANT NOTE: Pages used for Repair (N-8 to N-3) are excluded from the computation) SHA256_DIGEST7 for DIGEST[255:224], array offset: 0x1C0, array step: 0x4 */
  union {                                          /* offset: 0x1E0 */
    struct {                                         /* offset: 0x1E0 */
      __IO uint32_t ECID_BACKUP_0;                     /**< , offset: 0x1E0 */
      __IO uint32_t ECID_BACKUP_1;                     /**< , offset: 0x1E4 */
      __IO uint32_t ECID_BACKUP_2;                     /**< , offset: 0x1E8 */
      __IO uint32_t ECID_BACKUP_3;                     /**< , offset: 0x1EC */
    } ECID_BACKUP;
    __IO uint32_t ECID_BACKUP_ARRAY[4];              /**< ECID backup (the original is in page n-1), array offset: 0x1E0, array step: 0x4 */
  };
       uint32_t CHECKSUM[4];                       /**< Checksum of the whole page, array offset: 0x1F0, array step: 0x4 */
       uint8_t RESERVED_7[2732];
  __IO uint32_t DIS_ROM_HIDING;                    /**< , offset: 0xCAC */
       uint8_t RESERVED_8[12];
  __IO uint32_t PUF_SRAM;                          /**< , offset: 0xCBC */
} FLASH_NMPA_Type;

/* ----------------------------------------------------------------------------
   -- FLASH_NMPA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLASH_NMPA_Register_Masks FLASH_NMPA Register Masks
 * @{
 */

/*! @name GPO0_0 - GPO0 register 0 description */
/*! @{ */

