nxp-mcuxpresso/mcux-sdk/devices/LPC5504CPXXXX/LPC5504CPXXXX.h
/* The count of FLASH_NMPA_UUID_ARRAY */
#define FLASH_NMPA_UUID_ARRAY_COUNT              (4U)

/*! @name WAFER_TEST1_PROGRAM_VERSION -  */
/*! @{ */

#define FLASH_NMPA_WAFER_TEST1_PROGRAM_VERSION_WT1_PROGRAM_VERSION_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_WAFER_TEST1_PROGRAM_VERSION_WT1_PROGRAM_VERSION_SHIFT (0U)
/*! WT1_PROGRAM_VERSION - WT1_PROGRAM_VERSION [xx.yy stored as : 100*x+y]
 */
#define FLASH_NMPA_WAFER_TEST1_PROGRAM_VERSION_WT1_PROGRAM_VERSION(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_WAFER_TEST1_PROGRAM_VERSION_WT1_PROGRAM_VERSION_SHIFT)) & FLASH_NMPA_WAFER_TEST1_PROGRAM_VERSION_WT1_PROGRAM_VERSION_MASK)
/*! @} */

/*! @name WAFER_TEST1_DATE -  */
/*! @{ */

#define FLASH_NMPA_WAFER_TEST1_DATE_WT1_DATE_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_WAFER_TEST1_DATE_WT1_DATE_SHIFT (0U)
/*! WT1_DATE - WT1_DATE [stored as : year*10000+month*100+day]
 */
#define FLASH_NMPA_WAFER_TEST1_DATE_WT1_DATE(x)  (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_WAFER_TEST1_DATE_WT1_DATE_SHIFT)) & FLASH_NMPA_WAFER_TEST1_DATE_WT1_DATE_MASK)
/*! @} */

/*! @name WAFER_TEST1_TIME -  */
/*! @{ */

#define FLASH_NMPA_WAFER_TEST1_TIME_WT1_TIME_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_WAFER_TEST1_TIME_WT1_TIME_SHIFT (0U)
/*! WT1_TIME - WT1_TIME [stored as : hour*10000+minute*100+seconde]
 */
#define FLASH_NMPA_WAFER_TEST1_TIME_WT1_TIME(x)  (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_WAFER_TEST1_TIME_WT1_TIME_SHIFT)) & FLASH_NMPA_WAFER_TEST1_TIME_WT1_TIME_MASK)
/*! @} */

/*! @name WAFER_TEST2_PROGRAM_VERSION -  */
/*! @{ */

#define FLASH_NMPA_WAFER_TEST2_PROGRAM_VERSION_WT2_PROGRAM_VERSION_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_WAFER_TEST2_PROGRAM_VERSION_WT2_PROGRAM_VERSION_SHIFT (0U)
/*! WT2_PROGRAM_VERSION - WT2_PROGRAM_VERSION [xx.yy stored as : 100*x+y]
 */
#define FLASH_NMPA_WAFER_TEST2_PROGRAM_VERSION_WT2_PROGRAM_VERSION(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_WAFER_TEST2_PROGRAM_VERSION_WT2_PROGRAM_VERSION_SHIFT)) & FLASH_NMPA_WAFER_TEST2_PROGRAM_VERSION_WT2_PROGRAM_VERSION_MASK)
/*! @} */

/*! @name WAFER_TEST2_DATE -  */
/*! @{ */

#define FLASH_NMPA_WAFER_TEST2_DATE_WT2_DATE_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_WAFER_TEST2_DATE_WT2_DATE_SHIFT (0U)
/*! WT2_DATE - WT2_DATE [stored as : year*10000+month*100+day]
 */
#define FLASH_NMPA_WAFER_TEST2_DATE_WT2_DATE(x)  (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_WAFER_TEST2_DATE_WT2_DATE_SHIFT)) & FLASH_NMPA_WAFER_TEST2_DATE_WT2_DATE_MASK)
/*! @} */

/*! @name WAFER_TEST2_TIME -  */
/*! @{ */

#define FLASH_NMPA_WAFER_TEST2_TIME_WT2_TIME_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_WAFER_TEST2_TIME_WT2_TIME_SHIFT (0U)
/*! WT2_TIME - WT2_TIME [stored as : hour*10000+minute*100+seconde]
 */
#define FLASH_NMPA_WAFER_TEST2_TIME_WT2_TIME(x)  (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_WAFER_TEST2_TIME_WT2_TIME_SHIFT)) & FLASH_NMPA_WAFER_TEST2_TIME_WT2_TIME_MASK)
/*! @} */

/*! @name USBCFG -  */
/*! @{ */

#define FLASH_NMPA_USBCFG_XO32M_READY_TIME_OUT_MS_MASK (0xFFU)
#define FLASH_NMPA_USBCFG_XO32M_READY_TIME_OUT_MS_SHIFT (0U)
#define FLASH_NMPA_USBCFG_XO32M_READY_TIME_OUT_MS(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_USBCFG_XO32M_READY_TIME_OUT_MS_SHIFT)) & FLASH_NMPA_USBCFG_XO32M_READY_TIME_OUT_MS_MASK)

#define FLASH_NMPA_USBCFG_USB_SPEED_MASK         (0xFF00U)
#define FLASH_NMPA_USBCFG_USB_SPEED_SHIFT        (8U)
/*! USB_SPEED - USB_SPEED[7:0]= 0x00 : USB High Speed Module used for ISP 0x01 : USB Full SPeed
 *    Module used for ISP 0x02 : Neither USB High Speed module nor USB Full Speed module used for ISP
 *    0x03 - 0xFF : RESERVED
 */
#define FLASH_NMPA_USBCFG_USB_SPEED(x)           (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_USBCFG_USB_SPEED_SHIFT)) & FLASH_NMPA_USBCFG_USB_SPEED_MASK)

#define FLASH_NMPA_USBCFG_USB_USE_XO32M_CAPA_BANKS_MASK (0x10000U)
#define FLASH_NMPA_USBCFG_USB_USE_XO32M_CAPA_BANKS_SHIFT (16U)
/*! USB_USE_XO32M_CAPA_BANKS - Enable the use of Crystal 32 MHz internal Capa Banks during the
 *    configuration of the High Speed USB for ISP: 0: Disable Crystal 32 MHz CapaBanks. 1: Enable Crystal
 *    32 MHz CapaBanks.
 */
#define FLASH_NMPA_USBCFG_USB_USE_XO32M_CAPA_BANKS(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_USBCFG_USB_USE_XO32M_CAPA_BANKS_SHIFT)) & FLASH_NMPA_USBCFG_USB_USE_XO32M_CAPA_BANKS_MASK)
/*! @} */

/*! @name PERIPHENCFG -  */
/*! @{ */

#define FLASH_NMPA_PERIPHENCFG_PERIPHERAL_CONFIGURATION_MASK (0xFFFFU)
#define FLASH_NMPA_PERIPHENCFG_PERIPHERAL_CONFIGURATION_SHIFT (0U)
#define FLASH_NMPA_PERIPHENCFG_PERIPHERAL_CONFIGURATION(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PERIPHENCFG_PERIPHERAL_CONFIGURATION_SHIFT)) & FLASH_NMPA_PERIPHENCFG_PERIPHERAL_CONFIGURATION_MASK)

#define FLASH_NMPA_PERIPHENCFG_CPU1_ENABLE_MASK  (0x80000000U)
#define FLASH_NMPA_PERIPHENCFG_CPU1_ENABLE_SHIFT (31U)
#define FLASH_NMPA_PERIPHENCFG_CPU1_ENABLE(x)    (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PERIPHENCFG_CPU1_ENABLE_SHIFT)) & FLASH_NMPA_PERIPHENCFG_CPU1_ENABLE_MASK)
/*! @} */

/*! @name RAMSIZECFG -  */
/*! @{ */

#define FLASH_NMPA_RAMSIZECFG_SRAM_CONFIGURATION_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_RAMSIZECFG_SRAM_CONFIGURATION_SHIFT (0U)
#define FLASH_NMPA_RAMSIZECFG_SRAM_CONFIGURATION(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_RAMSIZECFG_SRAM_CONFIGURATION_SHIFT)) & FLASH_NMPA_RAMSIZECFG_SRAM_CONFIGURATION_MASK)
/*! @} */

/*! @name FLASHSIZECFG -  */
/*! @{ */

#define FLASH_NMPA_FLASHSIZECFG_FLASH_CONFIGURATION_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_FLASHSIZECFG_FLASH_CONFIGURATION_SHIFT (0U)
#define FLASH_NMPA_FLASHSIZECFG_FLASH_CONFIGURATION(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_FLASHSIZECFG_FLASH_CONFIGURATION_SHIFT)) & FLASH_NMPA_FLASHSIZECFG_FLASH_CONFIGURATION_MASK)
/*! @} */

/*! @name RINGO_0 -  */
/*! @{ */

#define FLASH_NMPA_RINGO_0_RINGO_0_CTRL_VALID_MASK (0x1U)
#define FLASH_NMPA_RINGO_0_RINGO_0_CTRL_VALID_SHIFT (0U)
/*! RINGO_0_CTRL_VALID - 1: RINGO_0_CTRL is valid.
 */
#define FLASH_NMPA_RINGO_0_RINGO_0_CTRL_VALID(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_RINGO_0_RINGO_0_CTRL_VALID_SHIFT)) & FLASH_NMPA_RINGO_0_RINGO_0_CTRL_VALID_MASK)

#define FLASH_NMPA_RINGO_0_RINGO_0_CTRL_MASK     (0xFFFFFFFEU)
#define FLASH_NMPA_RINGO_0_RINGO_0_CTRL_SHIFT    (1U)
/*! RINGO_0_CTRL - To copy RINGO_0_CTRL = ANACTRL->RINGO0_CTRL[30:0]
 */
#define FLASH_NMPA_RINGO_0_RINGO_0_CTRL(x)       (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_RINGO_0_RINGO_0_CTRL_SHIFT)) & FLASH_NMPA_RINGO_0_RINGO_0_CTRL_MASK)
/*! @} */

/*! @name RINGO_1 -  */
/*! @{ */

#define FLASH_NMPA_RINGO_1_RINGO_1_CTRL_VALID_MASK (0x1U)
#define FLASH_NMPA_RINGO_1_RINGO_1_CTRL_VALID_SHIFT (0U)
/*! RINGO_1_CTRL_VALID - 1: RINGO_1_CTRL is valid.
 */
#define FLASH_NMPA_RINGO_1_RINGO_1_CTRL_VALID(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_RINGO_1_RINGO_1_CTRL_VALID_SHIFT)) & FLASH_NMPA_RINGO_1_RINGO_1_CTRL_VALID_MASK)

#define FLASH_NMPA_RINGO_1_RINGO_1_CTRL_MASK     (0xFFFFFFFEU)
#define FLASH_NMPA_RINGO_1_RINGO_1_CTRL_SHIFT    (1U)
/*! RINGO_1_CTRL - To copy RINGO_1_CTRL = ANACTRL->RINGO1_CTRL[30:0]
 */
#define FLASH_NMPA_RINGO_1_RINGO_1_CTRL(x)       (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_RINGO_1_RINGO_1_CTRL_SHIFT)) & FLASH_NMPA_RINGO_1_RINGO_1_CTRL_MASK)
/*! @} */

